{
  "page": "Discovering Infrastructure",
  "stages": [
    {
      "header": "A single page",
      "subtitle": "Document page",
      "content": "Picture a page&mdash;filled with text, with images, with information.<br><br>A book is made up of hundreds of pages; a library collection is made up of millions. In the 2016&ndash;2017 financial, year, the State Library of New South Wales digitised over 600,000 pages."
    },
    {
      "header": "Archival standards",
      "subtitle": "Archival master",
      "content": "Great care goes into the digitisation of every page at SLNSW. Each page is scanned following a well-defined set of requirements, ranging from image size, resolution and cropping to colour correction and quality control. These requirements ensure that the Library maintains archival standards in their digital collections."
    },
    {
      "header": "Staying organised",
      "subtitle": "File storage",
      "content": "All the files created during digitisation are stored in a predefined file structure. The focus of the digitisation effort&mdash;the archival master images&mdash;are stored sequentially, following a strict naming convention.<br><br>Aside from the images themselves, a significant amount of other data is also stored. Administrative files, checksum data, and a wealth of metadata round out the 'intellectual entity'; what the Library calls the collection of files that make up a single digitised book."
    },
    {
      "header": "Supplementary scans",
      "subtitle": "Reference scans",
      "content": "At the start of each book's digitisation, three reference images are taken. The first, the title scan, records the book being digitised, the date, and other administrative information. The second and third images, the resolution scans, ensure the resolution, focus, scale, and colour settings of the camera in order to maintain a consistent, archival quality.<br><br>Also included here are foldout scans; any oversize foldout pages are digitised in their closed state within the book, and then separately photographed in the opened state, usually with different equipment."
    },
    {
      "header": "Safety first",
      "subtitle": "Checksum data",
      "content": "Just as with their physical counterparts, digital books are susceptible to damage and decay over time&mdash;ensuring the safety and quality of the Library's digital collections is a top priority.<br><br>In order to ensure that no image data is lost or corrupted, every file is run through a cryptographic hash function to produce a unique key, which are stored together in a checksum manifest along with the images. If even a single pixel in a single image is edited, the key won't match, and the records will show it."
    },
    {
      "header": "The metadata within",
      "subtitle": "Embedded metadata",
      "content": "Digitisation is a process of translation; light bouncing off the page of a book, captured by a camera's hardware, and encoded by its software into the Tagged Image File Format, a TIFF image.<br><br>Every archival master file has metadata embedded within its TIFF tags. While some of this information identifies the book in the image, most of it is concerned with ensuring that the image can be displayed correctly; that this code can again be translated into an image."
    },
    {
      "header": "All the other metadata",
      "subtitle": "External metadata",
      "content": "As well as the embedded metadata, an external metadata spreadsheet is stored which contains a wealth of descriptive and administrative information.<br><br>This metadata serves a variety of purposes, identifying and describing the book across various software systems, ensuring all images are accounted for, and enabling the management and quality control of the files."
    },
    {
      "header": "An ecosystem of digitisation",
      "subtitle": "Finished",
      "content": "This complex network of standards, practices, metadata, hardware, and software exists behind every single digitised book page held by SLNSW.<br><br>Without all of this, there would be no digitised library collections."
    }
  ]
}
